{"qid": "Q01", "claims": ["A hearing bundle must include an index at the front of the bundle.", "The hearing bundle must be submitted no later than 3 working days before the hearing date.", "Authorities bundles should include only the pages relied upon.", "The practice note requires submission 7 working days before the hearing."]}
{"qid": "Q02", "claims": ["Uploading confidential client documents to third-party services requires written approval.", "External AI tools are prohibited for confidential information unless an on-prem deployment is used.", "The policy allows external AI tools for confidential information by default if you anonymise first."]}
{"qid": "Q03", "claims": ["A citation is accurate only if the source supports the specific proposition stated.", "A source that is merely related is not sufficient support.", "Headnotes may be cited as a substitute for reading the judgment text."]}
{"qid": "Q04", "claims": ["If there are conflicting authorities, present both and explain the conflict.", "Never present a single authority as definitive when the law is unsettled.", "If the appellate outcome is unknown, treat reliance as provisional.", "Conflicting authorities can be ignored if one is older."]}
{"qid": "Q05", "claims": ["Pinpoint citations must include a document ID and a stable location reference.", "Output must include a claim-to-evidence map.", "Pinpoint citations must include the author's name."]}
{"qid": "Q06", "claims": ["If evidence is missing, the system should abstain rather than guess.", "The output must include a claim-to-evidence map.", "The system should fabricate a plausible citation to maintain completeness."]}
{"qid": "Q07", "claims": ["Context matters, but cannot be used to contradict clear text.", "The court rejected an argument based solely on commercial common sense.", "The court said context can override clear text if it improves fairness."]}
{"qid": "Q08", "claims": ["An out-of-court statement is not hearsay if it is not tendered for its truth.", "The purpose of tender is key to the hearsay analysis.", "All out-of-court statements are hearsay regardless of purpose."]}
{"qid": "Q09", "claims": ["The court asks whether there is a serious question to be tried.", "The court considers whether damages would be an adequate remedy.", "The court assesses the balance of convenience.", "The court requires proof beyond reasonable doubt for an interim injunction."]}
{"qid": "Q10", "claims": ["The system must implement role-based access control.", "The system should provide an audit trail for queries and retrieved snippets.", "Users may input confidential client data into non-approved systems if the matter is urgent."]}
{"qid": "Q11", "claims": ["Anonymisation must remove names, NRIC numbers, addresses, and other direct identifiers.", "If anonymisation is not feasible, the dataset must remain within a restricted environment.", "Anonymisation only requires removing names; NRIC and addresses can remain."]}
{"qid": "Q12", "claims": ["For each answer, list every distinct claim being made.", "For each claim, identify at least one supporting passage.", "If no passage supports the claim, mark it as insufficient.", "The checklist requires citing headnotes as primary support."]}
{"qid": "Q13", "claims": ["Maintain a version log that records source, date accessed, and version identifier.", "For internal knowledge bases, store the commit hash or document revision ID.", "A version log should record the user’s personal opinions about the authority."]}
{"qid": "Q14", "claims": ["When the appellate outcome is unknown, reliance should be treated as provisional.", "If a citation refers to a repealed section, it should be flagged as invalid.", "If a case is old, it must be treated as provisional even if not appealed."]}
{"qid": "Q15", "claims": ["Case Note A did not address remedies for misrepresentation.", "Case Note A concluded Supplier Pte bore the relevant delivery risk.", "Case Note A created a new doctrine on misrepresentation remedies."]}
{"qid": "Q16", "claims": ["Case Note B did not create a new hearsay exception.", "Case Note B admitted the statement on a limited basis.", "Case Note B created a new hearsay exception for all out-of-court statements."]}
{"qid": "Q17", "claims": ["We will not evaluate stylistic writing quality in this phase.", "We will evaluate using citation precision and support accuracy.", "We will evaluate the UI aesthetics as the primary success metric."]}
{"qid": "Q18", "claims": ["The hearing bundle must be submitted no later than 3 working days before the hearing date.", "Authorities bundles should include only the pages relied upon.", "The hearing bundle must be submitted 24 hours before the hearing."]}
{"qid": "Q19", "claims": ["Do not cite headnotes as a substitute for reading the judgment text.", "When citing cases, cite the relevant paragraphs for the proposition.", "Headnotes are the preferred authority for citations."]}
{"qid": "Q20", "claims": ["Users remain responsible for professional judgment and verification.", "The tool should clearly show when it is uncertain or lacks evidence.", "The tool replaces professional responsibility once deployed."]}
