{"qid": "Q01", "question": "What must a hearing bundle include, and when must it be submitted?"}
{"qid": "Q02", "question": "Under the confidentiality policy, when is using external AI tools allowed?"}
{"qid": "Q03", "question": "What makes a citation 'accurate' according to the guidance, and what is explicitly not sufficient?"}
{"qid": "Q04", "question": "What should you do when authorities conflict or the law is unsettled?"}
{"qid": "Q05", "question": "What are the mandatory fields for a 'pinpoint citation' in the project scope memo?"}
{"qid": "Q06", "question": "What should the system do if evidence is missing for a claim?"}
{"qid": "Q07", "question": "In Case Note A, what did the court say about using context to interpret clear text?"}
{"qid": "Q08", "question": "In Case Note B, why is an out-of-court statement not always hearsay?"}
{"qid": "Q09", "question": "What is the three-part test for interim injunctions in Case Note C?"}
{"qid": "Q10", "question": "List two tool governance requirements from the Terms of Use."}
{"qid": "Q11", "question": "What personal data must be removed in anonymisation per the confidentiality policy?"}
{"qid": "Q12", "question": "What does the research checklist require you to do for every answer?"}
{"qid": "Q13", "question": "What does the versioning memo recommend recording in a version log?"}
{"qid": "Q14", "question": "When should reliance on case law be treated as provisional?"}
{"qid": "Q15", "question": "Does Case Note A address remedies for misrepresentation?"}
{"qid": "Q16", "question": "Does Case Note B create a new hearsay exception?"}
{"qid": "Q17", "question": "What is explicitly out of scope for evaluation in the project scope excerpt?"}
{"qid": "Q18", "question": "What is the required deadline for submitting the hearing bundle?"}
{"qid": "Q19", "question": "What should you avoid citing as a substitute for reading the judgment?"}
{"qid": "Q20", "question": "What should users remain responsible for under the Terms of Use?"}
